namespace Wordle.App;

public class WordDictionary
{
    public int WordLength { get; init; }

    public WordDictionary(int wordLength)
    {
        if (wordLength <= 0)
            throw new ArgumentOutOfRangeException($"Длина слова должна быть целым положительным числом");

        foreach (var word in Words.Values)
            if (word.Length != wordLength)
                throw new ArgumentException($"Слово '{word}' должно содержать {wordLength} букв.");

        WordLength = wordLength;
    }

    public readonly Dictionary<int, string> Words = new()
    {
        [0] = "арбуз",
        [1] = "банан",
        [2] = "берег",
        [3] = "билет",
        [4] = "бочка",
        [5] = "вагон",
        [6] = "ветер",
        [7] = "вилка",
        [8] = "волна",
        [9] = "город",
        [10] = "груша",
        [11] = "дверь",
        [12] = "дождь",
        [13] = "замок",
        [14] = "земля",
        [15] = "игрок",
        [16] = "кабан",
        [17] = "норка",
        [18] = "книга",
        [19] = "кошка",
        [20] = "лампа",
        [21] = "лодка",
        [22] = "маска",
        [23] = "метро",
        [24] = "мышка",
        [25] = "около",
        [26] = "отбор",
        [27] = "парус",
        [28] = "песок",
        [29] = "пилот",
        [30] = "пламя",
        [31] = "полка",
        [32] = "почта",
        [33] = "птица",
        [34] = "ручка",
        [35] = "самса",
        [36] = "сапог",
        [37] = "стена",
        [38] = "трава",
        [39] = "труба",
        [40] = "фрукт",
        [41] = "шапка",
        [42] = "шарик",
        [43] = "школа",
        [44] = "агент",
        [45] = "якорь",
        [46] = "акула",
        [47] = "океан",
        [48] = "осень",
        [49] = "рыбак",
    };
}
